# Задание №151

---

### (Е. Джобс) Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
> **1. Прибавь 1**
> 
> **2. Умножь на 2**
> 
> **3. Сделай нечётное**

### Первая команда увеличивает число на 1, вторая – вдвое, третья прибавляет к четному числу 1, к нечетному – 2 Сколько существует таких программ, которые исходное число 3 преобразуют в число 25 и при этом траектория вычислений программы содержит число 9 и число 17?

---

### Решение

```python
def numProg(start, x):
    if x < start: return 0
    if x == start: return 1
    if start % 2 == 0:
        start3 = start + 1
    else:
        start3 = start + 2
    return numProg(start + 1, x) + numProg(start * 2, x) + numProg(start3, x)

print(numProg(3, 9) * numProg(9, 17) * numProg(17, 25))

```

**Ответ:** _229635_