# Задание №39

---

(Б.С. Михлин) Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [573213; 575340] число с минимальной  суммой делителей, имеющее ровно четыре делителя. Для найденного числа выведите сумму делителей и наибольший нетривиальный делитель (не равный самому числу). 

---

### Решение

```python
numbers = []
for i in range(573213, 575340 + 1):
    divs = []
    for d in range(1, i + 1):
        if i % d == 0:
            divs.append(d)
    if len(divs) == 4:
        numbers.append(divs)

minimal = numbers[0]

for i in numbers[1:]:
    if sum(i) < sum(minimal):
        minimal = i.copy()

print(sum(minimal), minimal[-2])
```

**Ответ:** 
```
574992 967
```