# Задание №150

---

(Е. Джобс) Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть две команды, которым присвоены номера:
> **1. Прибавь 3**
> 
> **2. Умножь на 3**

Сколько различных чётных чисел, меньших 100, может получить Калькулятор из исходного числа 3?

---

### Решение

```python
numbers = {}

def f(x):
    if x >= 100:
        return
    if x % 2 == 0:
        numbers[x] = None
    f(x+3), f(x*3)

f(3)
print(len(numbers))
```

**Ответ:** _16_