# Задание №135

---

(А. Комков) Исполнитель Нолик преобразует двоичное число, записанное на экране. У
исполнителя есть две команды, которым присвоены номера:
> **1. Прибавить 1**
>
> **2. Добавить слева 1**

Первая команда увеличивает число на 1 Вторая команда приписывает к двоичному числу слева 1,
например, для числа 10 результатом работы данной команды будет являться число 110 Сколько
существует программ, которые исходное двоичное число 100 преобразуют в двоичное число
110001?

---

### Решение

```python
import math

def f(start, x):
    if start > x: return 0
    if start == x: return 1
    return f(start+1, x) + f(start | 2 ** int(math.log2(start) + 1), x)

print(f(int('100', 2), int('110001', 2)))
```

**Ответ:** _33_