# Задание №152

---

### Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть две команды, которым присвоены номера:
> **1. Прибавь 1**
>
> **2. Прибавь 2**

### Первая команда увеличивает число на 1, вторая – на 2 Сколько существует таких программ, которые исходное число 11 преобразуют в число 29, и при этом траектория вычислений содержит либо 17, либо 23, либо 17 и 23 одновременно?

---

### Решение

```python
def numProg(start, x):
    if x < start: return 0
    if x == start: return 1
    return numProg(start + 1, x) + numProg(start + 2, x)

part_1 = numProg(11, 17) * numProg(17, 29)
part_2 = numProg(11, 23) * numProg(23, 29)
part_general = numProg(11, 17) * numProg(17, 23) * numProg(23, 29)
print(part_1 + part_2 - part_general)
```

**Ответ:** _3861_