# Задание №130

---

(Е. Джобс) Исполнитель Простачок преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
> **1.  Прибавить 2**
>
> **2. Прибавить 3**
>
> **3. Умножить на 2**

Первая команда увеличивает число на 2, вторая – на 3, третья – увеличивает число вдвое. Сколько различных чисел может быть получено из числа 10 всеми возможными алгоритмами длиной 5 команд?

---

### Решение

```python
numbers = {}

def f(start, x):
    if x == 5:
        numbers[start] = True
        return
    f(start + 2, x + 1), f(start + 3, x + 1), f(start * 2, x + 1)

f(10, 0)
print(len(numbers))
```

**Ответ:** _83_