# Задание №127

---

(Е. Джобс) Исполнитель Умножитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:
> **1. Умножить на 2**
>
> **2. Умножить на 3**

Первая команда увеличивает число на экране в 2 раза, вторая – увеличивает значение в 3 раза. Сколько существует программ, для которых при исходном числе 8 результатом является число 3456, и при этом траектория вычислений содержит число 96.

---

### Решение

```python
def f(start, x):
    if start > x: return 0
    if start == x: return 1
    return f(start * 2, x) + f(start * 3, x)

print(f(8, 96) * f(96, 3456))
```

**Ответ:** _18_