# Задание №142

---

Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
> **1. Прибавь 1**
>
> **2. Прибавь 2**
>
> **3. Умножь на 3**

Сколько существует программ, которые преобразуют исходное число 1 в число 15, и при этом траектория вычислений содержит число 10 и не содержит числа 14?

---

### Решение

```python
actions = [lambda x: x + 1, lambda x: x + 2, lambda x: x * 3]

def f(start, x):
    if start > x: return 0
    elif start == x: return 1
    elif start == 14: return 0
    total = 0
    for i in actions:
        total += f(i(start), x)
    return total

print(f(1,10) * f(10,15))
```

**Ответ:** _252_