# Задание №132

---

Исполнитель Нолик преобразует двоичное число, записанное на экране. У
исполнителя есть три команды, которым присвоены номера:
> **1. Прибавить 1**
>
> **2. Добавить справа 0**
>
> **3. Добавить справа 1**

Первая команда увеличивает число на 1 При выполнении второй команды, исполнитель
приписывает справа к числу 0, а при выполнении третьей команды приписывает справа к числу 1
(например, для числа 10 результатом работы данных команд будут являться числа 100 и 101
соответственно).
Сколько существует программ, которые исходное двоичное число 101 преобразуют в двоичное

---

### Решение

```python
def f(start, x):
    if start > x: return 0
    if start == x: return 1
    return f(start + 1, x) + f(start << 1, x) + f((start << 1) + 1, x)

print(f(int('101', 2), int('101110', 2)))
```

**Ответ:** _254_