# Задание №149

---
Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть две
команды, которым присвоены номера:
> **1. Прибавь 1**
> 
> **2. Умножь на 2 и вычти 3**

Сколько различных результатов можно получить из исходного числа 3 после выполнения
программы, содержащей ровно 12 команд?
---

### Решение

```python
numbers = {}

def f(x, step):
    if step == 12:
        numbers[x] = None
        return
    f(x + 1, step + 1), f(x * 2 - 3, step + 1)

f(3, 0)
print(len(numbers))
```

**Ответ:** _377_