# Задание №126

---

(Е. Джобс) Исполнитель Вычислитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:
> **1. Прибавить 3**
>
> **2.Умножить на 2**

Первая команда увеличивает число на экране на 3, вторая – увеличивает значение в два раза. Сколько существует программ, для которых при исходном числе 12  результатом является число 96?

---

### Решение

```python
def f(start, x):
    if start > x: return 0
    if start == x: return 1
    return  f(start + 3, x) + f(start * 2, x)

print(f(12, 96))
```

**Ответ:** _40_