# Задание №131

---

(А. Комков) Исполнитель Нолик преобразует двоичное число, записанное на экране. У исполнителя есть три команды, которым присвоены номера: 
> **1. Прибавить 1**
>
> **2. Добавить справа 0**
>
> **3. Добавить справа 1**

Первая команда увеличивает число на 1. При выполнении второй команды, исполнитель справа к числу приписывает 0, а при выполнении третьей команды справа к числу приписывает 1. (например, для числа 10 результатом работы данных команд будут являться числа 100 и 101 соответственно). 
Сколько существует программ, которые исходное двоичное число 100 преобразуют в двоичное число 11101?

---

### Решение

```python
actions = [lambda x: x + 1, lambda x: x << 1, lambda x: (x << 1) + 1]

def f(start, x):
    if start > x: return 0
    if start == x: return 1
    total = 0
    for i in actions:
        total += f(i(start), x)
    return total

print(f(int('100', 2), int('11101', 2)))
```

**Ответ:** _79_