# Задание №128

---

(Е. Джобс) Исполнитель Простачок преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
> **1.  Прибавить 2**
>
> **2. Прибавить предыдущее**
>
> **3. Прибавить следующее**

Первая команда увеличивает число на 2, вторая – на предыдущее (например, число 5 будет преобразовано по правилу 5 + 4), третья – на следующее (аналогично, 5 по правилу 5 + 6 = 11). Сколько существует таких программ, которые исходное число 7 преобразуют в число 63, и при этом траектория вычислений не содержит число 43?

---

### Решение

```python
def f(start, x):
    if start > x: return 0
    if start == x: return 1
    if start == 43: return 0
    return f(start + 2, x) + f(start + start - 1, x) + f(start + start + 1, x)

print(f(7, 63))
```

**Ответ:** _116_