# Задание №143

---

Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
> **1. Прибавь 1**
>
> **2. Прибавь 3**
>
> **3. Умножь на 2**

Сколько существует программ, которые преобразуют исходное число 3 в число 21, и при этом траектория вычислений содержит число 8 и не содержит числа 12?

---

### Решение

```python
def f(start, x):
    if start > x: return 0
    elif start == x: return 1
    elif start == 12: return 0
    return f(start+1, x) + f(start+3, x) + f(start*2, x)

print(f(3,8) * f(8,21))
```

**Ответ:** _228_