# Задание №141

---

(А. Комков) Исполнитель Нолик преобразует число, записанное на экране в троичной системе счисления. У исполнителя есть две команды, которым присвоены номера:
> **1. Вычесть 2**
>
> **2. Обнулить младший разряд**

Первая команда уменьшает число на 2 Вторая команда обнуляет ненулевой младший разряд роичной записи числа. (Например, при выполнении этой команды число 21 преобразуется в число 20 Если в младшем разряде находится 0, то данная команда не выполняется). Сколько существует программ, которые троичное число 212, преобразуют в троичное число 10?

---

### Решение

```python
def f(start, end):
    if start < end: return 0
    if start == end: return 1
    if start % 3 == 0: return f(start - 2, end)
    return f(start - 2, end) + f(start - start % 3, end)

print(f(int('212', 3), int('10', 3)))
```

**Ответ:** _86_