# Задание №33

---

(Б.С. Михлин) Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [286564; 287270], числа, имеющие максимальное количество различных делителей. Если таких чисел несколько, то найдите максимальное из них. Выведите количество делителей найденного числа и два наибольших делителя в порядке убывания. 

---

### Решение

```python
numbers = []
for n in range(286564, 287270 + 1):
    divs = []
    for i in reversed(range(1, n+1)):
        if n % i == 0:
            divs.append(i)
    numbers.append(divs)
number = []
for i in numbers:
    if len(i) >= len(number):
        number = i.copy()
print(len(number), *number[:2])
```

**Ответ:** 
```
112 287040 143520
```