# Задание №136

---

(А. Комков) Исполнитель Нолик преобразует двоичное число, записанное на экране. У
исполнителя есть две команды, которым присвоены номера:
> **1. Прибавить 1**
>
> **2. Добавить слева 1**

Первая команда увеличивает число на 1 Вторая команда приписывает к двоичному числу слева 1,
например, для числа 10 результатом работы данной команды будет являться число 110 Сколько
существует программ, которые исходное двоичное число 1 преобразуют в двоичное число 11111?

---

### Решение

```python
def f(start, x):
    if start > x: return 0
    if start == x: return 1
    binary_number = bin(start)[2:]
    binary_number = int('1' + binary_number, 2)
    return f(start+1, x) + f(binary_number, x)

print(f(int('1', 2), int('11111', 2)))
```

**Ответ:** _82_