# Задание №138

---

### Исполнитель Нолик преобразует двоичное число, записанное на экране. У исполнителя есть две команды, которым присвоены номера:
> **1. Вычесть 1**
>
> **2. Обнулить**

### Первая команда уменьшает число на 1 Вторая команда обнуляет все ненулевые разряды, кроме старшего (например, для исходного числа 11101 результатом работы команды будет число 10000), если таких разрядов нет, то данная команда не выполняется. Сколько существует программ, которые исходное двоичное число 10001 преобразуют в двоичное число 1?

---

### Решение

```python
import math

def f(start, x):
    if start < x: return 0
    if start == x: return 1
    if math.log2(start) % 1 == 0: return f(start - 1, x)
    return f(start - 1, x) + f(2 ** (len(format(start, 'b')) - 1), x)

print(f(int('10001', 2), int('1', 2)))
```

**Ответ:** _128_