# Задание №35

---

(Б.С. Михлин) Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [394480; 394540], числа, имеющие максимальное количество различных делителей. Выведите информацию о таких числах, расположив их в порядке возрастания. Для каждого числа выведите его порядковый номер, количество делителей и два наибольших делителя в порядке убывания. 

---

### Решение

```python
numbers = []
for i in range(394480, 394540+1):
    divs = []
    for d in range(1, i + 1):
        if i % d == 0:
            divs.append(d)
    numbers.append(divs)

max_length = 0
for i in numbers:
    current_length = len(i)
    if current_length > max_length:
        max_length = current_length

for a,i in enumerate(numbers):
    if len(i) == max_length:
        i.reverse()
        print(a + 1, max_length, *i[:2])
```

**Ответ:** 
```
6 48 394485 131495
21 48 394500 197250
27 48 394506 197253
45 48 394524 197262
```