# Задание №139

---

Исполнитель Нолик преобразует двоичное число, записанное на экране. У исполнителя есть две команды, которым присвоены номера:
> **1. Вычесть 1**
>
> **2. Обнулить**

Первая команда уменьшает число на 1 Вторая команда обнуляет все ненулевые разряды, кроме старшего (например, для исходного числа 11101 результатом работы команды будет число 10000), если таких разрядов нет, то данная команда не выполняется. Сколько существует программ, которые исходное двоичное число 1000000 преобразуют в двоичное число 1000?

---

### Решение

```python
import math

def f(start, x):
    if start < x: return 0
    if start == x: return 1
    if math.log2(start) % 1 == 0: return f(start - 1, x)
    # binary_number - перевод числа из десятичной в двоичную систему исчесления
    binary_number = format(start, 'b') # OR bin(start)[2:]
    # (len(binary_number) - 1) - получаем количество цифр после единицы.
    # Например: 10000 -> 4; 1000 -> 3; 100000 -> 5;
    # Возводим в степень - 2 ** (len(binary_number) - 1)
    return f(start - 1, x) + f(2 ** (len(binary_number) - 1), x)


print(f(int('1000000', 2), int('1000', 2)))
```

**Ответ:** _4096_