# Задание №129

---

(Е. Джобс) Исполнитель ЛенивыйСчетовод преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
>**1. Прибавить 2**
>
>**2. Прибавить 3**
>
>**3. Дописать к числу справа 1**

Первая команда увеличивает число на 2, вторая – на 3, третья – приписывает к текущему значению цифру 1 (например, для 10 результатом выполнения данной команды будет 101). Сколько существует таких программ, которые исходное число 3 преобразуют в число 25, при этом траектория вычислений содержит число 12?

---

### Решение

```python
def f(start, x):
    if start > x: return 0
    if start == x: return 1
    return f(start + 2, x) + f(start + 3, x) + f(start * 10, x)

print(f(3, 12) * f(12, 25))
```

**Ответ:** _80_