# Задание №43

---

Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [1547341; 1547409], простые числа. Выведите все найденные простые числа в порядке возрастания, слева от каждого числа выведите его номер по порядку. 

---

### Решение

```python
place = 0
for i in range(154_7341, 154_7409):
    divs = 0
    for d in range(1, i+1):
        if i % d == 0:
            divs += 1
    if divs == 2:
        place += 1
        print(place, i)
```

**Ответ:** 
```
1 1547347
2 1547383
3 1547389
4 1547407
```