# Задание №41

---

Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [4671032; 4671106], простые числа. Выведите все найденные простые числа в порядке возрастания, слева от каждого числа выведите его номер по порядку. 

---

### Решение

```python
numbers = []
for i in range(4_671_032, 4_671_106 + 1):
    divs = []
    for d in range(1, i + 1):
        if i % d == 0:
            divs.append(d)
    if len(divs) == 2:
        numbers.append(divs)

for a, i in enumerate(numbers):
    print(a + 1, i[-1])
```

**Ответ:** 
```
1 4671071
2 4671077
3 4671097
4 4671101
```