# Задание №40

---

Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [2943444; 2943529], простые числа. Выведите все найденные простые числа в порядке возрастания, слева от каждого числа выведите его номер по порядку. 

---

### Решение

```python
numbers = []
for i in range(2943444, 2943529 + 1):
    divs = []
    for d in range(1, i + 1):
        if i % d == 0:
            divs.append(d)
    if len(divs) == 2:
        numbers.append(divs)

for a, i in enumerate(numbers):
    print(a + 1, i[1])
```

**Ответ:** 
```
1 2943467
2 2943491
3 2943503
4 2943527
```