# Задание №145

---

### Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть две команды, которым присвоены номера:
> **1. Умножь на 2**
>
> **2. Умножь на 2 и прибавь 1**

### Сколько различных результатов можно получить из исходного числа 1 после выполнения программы, содержащей ровно 15 команд?

---

### Решение

```python
numbers = {}

def f(x, step):
    if step == 15:
        numbers[x] = True
        return
    f(x * 2, step + 1), f(x * 2 + 1, step + 1)

f(1, 0)
print(len(numbers))
```

**Ответ:** _32768_