# Задание №37

---

 (Б.С. Михлин) Напишите программу, которая ищет среди нечётных целых чисел, принадлежащих числовому отрезку [248015; 251575] числа (в порядке возрастания) с нечётным количеством делителей. Для каждого такого числа выведите его порядковый номер (начиная с единицы), само число, количество его делителей и делитель, квадрат которого равен этому числу. 

---

### Решение

```python
numbers = []
for n in range(248015, 251575 + 1, 2):
    divs = []
    for d in range(1, n + 1):
        if n % d == 0:
            divs.append(d)
    if len(divs) % 2 == 1:
        numbers.append(divs)

for a, i in enumerate(numbers):
    print(a + 1, i[-1], len(i), int(i[-1] ** 0.5))
```

**Ответ:** 
```
1 249001 3 499
2 251001 9 501
```