# Задание №36

---

(Б.С. Михлин) Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [194441; 196500] числа (в порядке возрастания) с нечётным количеством делителей. Для каждого такого числа выведите его порядковый номер (начиная с единицы), само число, количество его делителей и делитель, квадрат которого равен этому числу. 

---

### Решение

```python
numbers = []
for number in range(194441, 196500 + 1):
    divs = []
    for d in range(1, number + 1):
        if number % d == 0:
            divs.append(d)
    if len(divs) % 2 == 1:
        numbers.append(divs)

for index, number in enumerate(numbers):
    print(index + 1, number[-1], len(number), int(number[-1] ** 0.5))
```

**Ответ:** 
```
1 194481 25 441
2 195364 27 442
3 196249 3 443
```