# Задание №144

---

Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
> **1. Прибавь 1**
>
> **2. Прибавь 2**
>
> **3. Прибавь 3**

Сколько существует программ, которые преобразуют исходное число 5 в число 18, и при этом траектория вычислений содержит число 11 и не содержит чисел 10 и 15?

---

### Решение

```python
def f(start, x):
    if start > x: return 0
    elif start == x: return 1
    elif start == 10 or start == 15: return 0
    return f(start + 1, x) + f(start + 2, x) + f(start + 3, x)

print(f(5, 11) * f(11, 18))
```

**Ответ:** _176_